In [1]:
# Import libraries
import pandas as pd
import os

In [2]:
file_path=os.path.join('.','resources','data','shopping_data.csv')
file_path

'.\\resources\\data\\shopping_data.csv'

In [3]:
df_shopping = pd.read_csv(file_path, encoding="ISO-8859-1")

In [4]:
df_shopping.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [5]:
# Columns
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [6]:
#  data types
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [7]:
# find null values
for column in df_shopping.columns:
    print(f"Clumn {column} has {df_shopping[column].isnull().sum()} null values")

Clumn CustomerID has 0 null values
Clumn Card Member has 2 null values
Clumn Age has 2 null values
Clumn Annual Income has 0 null values
Clumn Spending Score (1-100) has 1 null values

In [8]:
# Drop null rows
df_shopping = df_shopping.dropna()

In [9]:
# Find duplicat entries
print(f"Duplicate entries: {df_shopping.duplicated().sum()}")

Duplicate entries: 0

In [10]:
# Remove columns that doesn't add value
# CustomerID
df_shopping.drop(columns=["CustomerID"],inplace=True)

In [11]:
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

# 18.2.5

In [12]:
# Transform String column
def change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0

In [13]:
df_shopping["Card Member"]=df_shopping["Card Member"].apply(change_string)

In [14]:
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [15]:
# Transform magnitude
# annual income
df_shopping["Annual Income"] = df_shopping["Annual Income"] / 1000

In [16]:
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [22]:
df_shopping_2 = df_shopping.copy(deep=True)

In [23]:
type(df_shopping_2)

pandas.core.frame.DataFrame

In [24]:
df_shopping_2.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [25]:
df_shopping_2.rename(columns={'Card Member':'Card_Member','Annual Income':'Annual_Income','Spending Score (1-100)':'Spending_Score'})

     Card_Member   Age  Annual_Income  Spending_Score
0              1  19.0           15.0            39.0
1              1  21.0           15.0            81.0
2              0  20.0           16.0             6.0
3              0  23.0           16.0            77.0
4              0  31.0           17.0            40.0
..           ...   ...            ...             ...
198            0  35.0          120.0            79.0
199            0  45.0          126.0            28.0
200            1  32.0          126.0            74.0
201            1  32.0          137.0            18.0
202            1  30.0          137.0            83.0

[200 rows x 4 columns]

In [26]:
# Saving cleaned data
file_path = os.path.join('.','resources','data','shopping_cleaned_data.csv')
df_shopping.to_csv(file_path, index=False)